#include <MsgBoxConstants.au3>
#include <Array.au3>

; РџРѕР»СѓС‡Р°РµРј РІРµСЃСЊ С‚РµРєСЃС‚ РѕРєРЅР° Р¦РѕРґРґ.
Local $sText = WinGetText("РћР±СЉРµРєС‚С‹")

; Р Р°Р·Р±РёСЂР°РµРј С‚РµРєСЃС‚ РЅР° СЃС‚СЂРѕРєРё, РёСЃРїРѕР»СЊР·СѓСЋ СЃРєРѕР±РєСѓ РєР°Рє СЂР°Р·РґРµР»РёС‚РµР»СЊ 
$aArray = StringSplit($sText,@LF,1)

; Р’С‹РІРѕРґРёРј СЃРѕРѕР±С‰РµРЅРёРµ СЃ СЂРµР·СѓР»СЊС‚Р°С‚Р°РјРё, РѕСЃС‚Р°РІР»СЏСЏ С‚РѕР»СЊРєРѕ С†РёС„СЂС‹
MsgBox(4096, "Р’СЃРµРіРѕ", $aArray[32])

;~ 77000000000155700, 109240, 77, СЂ-РЅ РўР°РіР°РЅСЃРєРёР№, РїРµСЂ РљРѕС‚РµР»СЊРЅРёС‡РµСЃРєРёР№ 1-Р№, Рґ 5, СЃС‚СЂРѕРµРЅ 2