; РџСЂРёРјРµСЂ 1, Р·Р°РјРµРЅР° С‚РµРєСЃС‚Р°
$sText = StringReplace("СЌС‚Рѕ СЃС‚СЂРѕРєР° С‚РµРєСЃС‚Р°", " ", "%")
$iReplacements = @extended
MsgBox(4096, 'РЎС‚СЂРѕРєР° РїРѕСЃР»Рµ Р·Р°РјРµРЅС‹', $sText & @CRLF & @CRLF & _
        'РљРѕР»РёС‡РµСЃС‚РІРѕ СЃРґРµР»Р°РЅРЅС‹С… Р·Р°РјРµРЅ: ' & $iReplacements)

; РџСЂРёРјРµСЂ 2, Р·Р°РјРµРЅР° РІ РїРѕР·РёС†РёРё
$sText = StringReplace("СЌС‚Рѕ СЃС‚СЂРѕРєР° С‚РµРєСЃС‚Р°", 6, "---")
MsgBox(0, 'Р—Р°РјРµРЅР° РІ РїРѕР·РёС†РёРё', $sText)


$text = "77000000000155700, 109240, 77, СЂ-РЅ РўР°РіР°РЅСЃРєРёР№Рґ, РїРµСЂ РљРѕС‚РµР»СЊРЅРёС‡РµСЃРєРёР№ 1-Р№, Рґ 5, СЃС‚СЂРѕРµРЅ 2 РїРµСЂРµСѓР»РѕРє СЃС‚СЂРѕРµРЅС‡РёСЃ СЂ-РЅРѕРЅ"
$codAll = StringRegExpReplace($text,'РїРµСЂ|СЃС‚СЂРѕРµРЅ|[Рґ]|СЂ-РЅ','')
$codAll = StringRegExpReplace($codAll,',','')
;~ $codAll = StringRegExpReplace($codAll,' ','%')
MsgBox(0, 'Р—Р°РјРµРЅР°', $codAll)
